""" 
SQL - Structured Query Language - структурированный язык запросов - язык общения с базами данных

База данных (БД) - организованная структура для хранения больших объемов данных

Системы управления базами данных (СУБД) - программа для управления организацией БД
(создание, обновление, получение, удаление)

PostgreSQL, Access, MySQL, Oraacle, Redis...

Реляционные - имеют связи между таблицами
Нереяционные - не имеют связей (ключ, значение)

PostgreSQL - реляционная СУБД, имеет встроенные функции, открытый исходный код, частые обновления

Категории запросов
DDL (Data Definition Language) - работа над таблицами (Create, Alter, Drop)
DML (Data Manipulation Language) - работа с данными в таблицах (SELECT, INSERT, UPDATE, DELETE)
TCL (Transaction Control Language) - работа с транзакциями (COMMIT, ROLLBACK, SAVEPOINT)
"""